load/results/before/ramp.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/ramp.js
        output: -

     scenarios: (100.00%) 1 scenario, 120 max VUs, 1m30s max duration (incl. graceful stop):
              * mixed_ramp: Up to 120 looping VUs for 1m25s over 6 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (0m01.0s), 000/120 VUs, 0 complete and 0 interrupted iterations
mixed_ramp   [   1% ] 000/120 VUs  0m01.0s/1m25.0s

running (0m02.0s), 001/120 VUs, 260 complete and 0 interrupted iterations
mixed_ramp   [   2% ] 001/120 VUs  0m02.0s/1m25.0s

running (0m03.0s), 001/120 VUs, 880 complete and 0 interrupted iterations
mixed_ramp   [   4% ] 001/120 VUs  0m03.0s/1m25.0s

running (0m04.0s), 002/120 VUs, 1735 complete and 0 interrupted iterations
mixed_ramp   [   5% ] 002/120 VUs  0m04.0s/1m25.0s

running (0m05.0s), 003/120 VUs, 2650 complete and 0 interrupted iterations
mixed_ramp   [   6% ] 003/120 VUs  0m05.0s/1m25.0s

running (0m06.0s), 003/120 VUs, 3570 complete and 0 interrupted iterations
mixed_ramp   [   7% ] 003/120 VUs  0m06.0s/1m25.0s

running (0m07.0s), 004/120 VUs, 4558 complete and 0 interrupted iterations
mixed_ramp   [   8% ] 004/120 VUs  0m07.0s/1m25.0s

running (0m08.0s), 005/120 VUs, 5518 complete and 0 interrupted iterations
mixed_ramp   [   9% ] 005/120 VUs  0m08.0s/1m25.0s

running (0m09.0s), 005/120 VUs, 6358 complete and 0 interrupted iterations
mixed_ramp   [  11% ] 005/120 VUs  0m09.0s/1m25.0s

running (0m10.0s), 006/120 VUs, 7219 complete and 0 interrupted iterations
mixed_ramp   [  12% ] 006/120 VUs  0m10.0s/1m25.0s

running (0m11.0s), 007/120 VUs, 8103 complete and 0 interrupted iterations
mixed_ramp   [  13% ] 007/120 VUs  0m11.0s/1m25.0s

running (0m12.0s), 007/120 VUs, 9042 complete and 0 interrupted iterations
mixed_ramp   [  14% ] 007/120 VUs  0m12.0s/1m25.0s

running (0m13.0s), 008/120 VUs, 10014 complete and 0 interrupted iterations
mixed_ramp   [  15% ] 008/120 VUs  0m13.0s/1m25.0s

running (0m14.0s), 009/120 VUs, 10984 complete and 0 interrupted iterations
mixed_ramp   [  16% ] 009/120 VUs  0m14.0s/1m25.0s

running (0m15.0s), 009/120 VUs, 12006 complete and 0 interrupted iterations
mixed_ramp   [  18% ] 009/120 VUs  0m15.0s/1m25.0s

running (0m16.0s), 010/120 VUs, 12988 complete and 0 interrupted iterations
mixed_ramp   [  19% ] 010/120 VUs  0m16.0s/1m25.0s

running (0m17.0s), 011/120 VUs, 13999 complete and 0 interrupted iterations
mixed_ramp   [  20% ] 011/120 VUs  0m17.0s/1m25.0s

running (0m18.0s), 011/120 VUs, 14975 complete and 0 interrupted iterations
mixed_ramp   [  21% ] 011/120 VUs  0m18.0s/1m25.0s

running (0m19.0s), 012/120 VUs, 15999 complete and 0 interrupted iterations
mixed_ramp   [  22% ] 012/120 VUs  0m19.0s/1m25.0s

running (0m20.0s), 013/120 VUs, 17010 complete and 0 interrupted iterations
mixed_ramp   [  24% ] 013/120 VUs  0m20.0s/1m25.0s

running (0m21.0s), 013/120 VUs, 18085 complete and 0 interrupted iterations
mixed_ramp   [  25% ] 013/120 VUs  0m21.0s/1m25.0s

running (0m22.0s), 014/120 VUs, 19078 complete and 0 interrupted iterations
mixed_ramp   [  26% ] 014/120 VUs  0m22.0s/1m25.0s

running (0m23.0s), 015/120 VUs, 20019 complete and 0 interrupted iterations
mixed_ramp   [  27% ] 015/120 VUs  0m23.0s/1m25.0s

running (0m24.0s), 015/120 VUs, 21008 complete and 0 interrupted iterations
mixed_ramp   [  28% ] 015/120 VUs  0m24.0s/1m25.0s

running (0m25.0s), 016/120 VUs, 22004 complete and 0 interrupted iterations
mixed_ramp   [  29% ] 016/120 VUs  0m25.0s/1m25.0s

running (0m26.0s), 017/120 VUs, 23034 complete and 0 interrupted iterations
mixed_ramp   [  31% ] 017/120 VUs  0m26.0s/1m25.0s

running (0m27.0s), 017/120 VUs, 24090 complete and 0 interrupted iterations
mixed_ramp   [  32% ] 017/120 VUs  0m27.0s/1m25.0s

running (0m28.0s), 018/120 VUs, 25123 complete and 0 interrupted iterations
mixed_ramp   [  33% ] 018/120 VUs  0m28.0s/1m25.0s

running (0m29.0s), 019/120 VUs, 26124 complete and 0 interrupted iterations
mixed_ramp   [  34% ] 019/120 VUs  0m29.0s/1m25.0s

running (0m30.0s), 019/120 VUs, 27183 complete and 0 interrupted iterations
mixed_ramp   [  35% ] 019/120 VUs  0m30.0s/1m25.0s

running (0m31.0s), 021/120 VUs, 28240 complete and 0 interrupted iterations
mixed_ramp   [  36% ] 021/120 VUs  0m31.0s/1m25.0s

running (0m32.0s), 022/120 VUs, 29292 complete and 0 interrupted iterations
mixed_ramp   [  38% ] 022/120 VUs  0m32.0s/1m25.0s

running (0m33.0s), 023/120 VUs, 30332 complete and 0 interrupted iterations
mixed_ramp   [  39% ] 023/120 VUs  0m33.0s/1m25.0s

running (0m34.0s), 025/120 VUs, 31329 complete and 0 interrupted iterations
mixed_ramp   [  40% ] 025/120 VUs  0m34.0s/1m25.0s

running (0m35.0s), 026/120 VUs, 32326 complete and 0 interrupted iterations
mixed_ramp   [  41% ] 026/120 VUs  0m35.0s/1m25.0s

running (0m36.0s), 027/120 VUs, 33304 complete and 0 interrupted iterations
mixed_ramp   [  42% ] 027/120 VUs  0m36.0s/1m25.0s

running (0m37.0s), 029/120 VUs, 34264 complete and 0 interrupted iterations
mixed_ramp   [  44% ] 029/120 VUs  0m37.0s/1m25.0s

running (0m38.0s), 030/120 VUs, 35287 complete and 0 interrupted iterations
mixed_ramp   [  45% ] 030/120 VUs  0m38.0s/1m25.0s

running (0m39.0s), 031/120 VUs, 36300 complete and 0 interrupted iterations
mixed_ramp   [  46% ] 031/120 VUs  0m39.0s/1m25.0s

running (0m40.0s), 033/120 VUs, 37309 complete and 0 interrupted iterations
mixed_ramp   [  47% ] 033/120 VUs  0m40.0s/1m25.0s

running (0m41.0s), 034/120 VUs, 38326 complete and 0 interrupted iterations
mixed_ramp   [  48% ] 034/120 VUs  0m41.0s/1m25.0s

running (0m42.0s), 035/120 VUs, 39343 complete and 0 interrupted iterations
mixed_ramp   [  49% ] 035/120 VUs  0m42.0s/1m25.0s

running (0m43.0s), 037/120 VUs, 40348 complete and 0 interrupted iterations
mixed_ramp   [  51% ] 037/120 VUs  0m43.0s/1m25.0s

running (0m44.0s), 038/120 VUs, 41357 complete and 0 interrupted iterations
mixed_ramp   [  52% ] 038/120 VUs  0m44.0s/1m25.0s

running (0m45.0s), 039/120 VUs, 42335 complete and 0 interrupted iterations
mixed_ramp   [  53% ] 039/120 VUs  0m45.0s/1m25.0s

running (0m46.0s), 042/120 VUs, 43297 complete and 0 interrupted iterations
mixed_ramp   [  54% ] 042/120 VUs  0m46.0s/1m25.0s

running (0m47.0s), 045/120 VUs, 44267 complete and 0 interrupted iterations
mixed_ramp   [  55% ] 045/120 VUs  0m47.0s/1m25.0s

running (0m48.0s), 047/120 VUs, 45240 complete and 0 interrupted iterations
mixed_ramp   [  56% ] 047/120 VUs  0m48.0s/1m25.0s

running (0m49.0s), 050/120 VUs, 46245 complete and 0 interrupted iterations
mixed_ramp   [  58% ] 050/120 VUs  0m49.0s/1m25.0s

running (0m50.0s), 053/120 VUs, 47258 complete and 0 interrupted iterations
mixed_ramp   [  59% ] 053/120 VUs  0m50.0s/1m25.0s

running (0m51.0s), 055/120 VUs, 48241 complete and 0 interrupted iterations
mixed_ramp   [  60% ] 055/120 VUs  0m51.0s/1m25.0s

running (0m52.0s), 058/120 VUs, 49265 complete and 0 interrupted iterations
mixed_ramp   [  61% ] 058/120 VUs  0m52.0s/1m25.0s

running (0m53.0s), 061/120 VUs, 50234 complete and 0 interrupted iterations
mixed_ramp   [  62% ] 061/120 VUs  0m53.0s/1m25.0s

running (0m54.0s), 063/120 VUs, 51214 complete and 0 interrupted iterations
mixed_ramp   [  64% ] 063/120 VUs  0m54.0s/1m25.0s

running (0m55.0s), 066/120 VUs, 52207 complete and 0 interrupted iterations
mixed_ramp   [  65% ] 066/120 VUs  0m55.0s/1m25.0s

running (0m56.0s), 069/120 VUs, 53198 complete and 0 interrupted iterations
mixed_ramp   [  66% ] 069/120 VUs  0m56.0s/1m25.0s

running (0m57.0s), 071/120 VUs, 54160 complete and 0 interrupted iterations
mixed_ramp   [  67% ] 071/120 VUs  0m57.0s/1m25.0s

running (0m58.0s), 074/120 VUs, 55162 complete and 0 interrupted iterations
mixed_ramp   [  68% ] 074/120 VUs  0m58.0s/1m25.0s

running (0m59.0s), 077/120 VUs, 56192 complete and 0 interrupted iterations
mixed_ramp   [  69% ] 077/120 VUs  0m59.0s/1m25.0s

running (1m00.0s), 079/120 VUs, 57199 complete and 0 interrupted iterations
mixed_ramp   [  71% ] 079/120 VUs  1m00.0s/1m25.0s

running (1m01.0s), 082/120 VUs, 58178 complete and 0 interrupted iterations
mixed_ramp   [  72% ] 082/120 VUs  1m01.0s/1m25.0s

running (1m02.0s), 085/120 VUs, 59197 complete and 0 interrupted iterations
mixed_ramp   [  73% ] 085/120 VUs  1m02.0s/1m25.0s

running (1m03.0s), 087/120 VUs, 60181 complete and 0 interrupted iterations
mixed_ramp   [  74% ] 087/120 VUs  1m03.0s/1m25.0s

running (1m04.0s), 090/120 VUs, 61162 complete and 0 interrupted iterations
mixed_ramp   [  75% ] 090/120 VUs  1m04.0s/1m25.0s

running (1m05.0s), 093/120 VUs, 62135 complete and 0 interrupted iterations
mixed_ramp   [  76% ] 093/120 VUs  1m05.0s/1m25.0s

running (1m06.0s), 095/120 VUs, 63000 complete and 0 interrupted iterations
mixed_ramp   [  78% ] 095/120 VUs  1m06.0s/1m25.0s

running (1m07.0s), 098/120 VUs, 64015 complete and 0 interrupted iterations
mixed_ramp   [  79% ] 098/120 VUs  1m07.0s/1m25.0s

running (1m08.0s), 101/120 VUs, 65033 complete and 0 interrupted iterations
mixed_ramp   [  80% ] 101/120 VUs  1m08.0s/1m25.0s

running (1m09.0s), 103/120 VUs, 65597 complete and 0 interrupted iterations
mixed_ramp   [  81% ] 103/120 VUs  1m09.0s/1m25.0s

running (1m10.0s), 106/120 VUs, 66077 complete and 0 interrupted iterations
mixed_ramp   [  82% ] 106/120 VUs  1m10.0s/1m25.0s

running (1m11.0s), 109/120 VUs, 66997 complete and 0 interrupted iterations
mixed_ramp   [  84% ] 109/120 VUs  1m11.0s/1m25.0s

running (1m12.0s), 111/120 VUs, 67930 complete and 0 interrupted iterations
mixed_ramp   [  85% ] 111/120 VUs  1m12.0s/1m25.0s

running (1m13.0s), 114/120 VUs, 68914 complete and 0 interrupted iterations
mixed_ramp   [  86% ] 114/120 VUs  1m13.0s/1m25.0s

running (1m14.0s), 117/120 VUs, 69865 complete and 0 interrupted iterations
mixed_ramp   [  87% ] 117/120 VUs  1m14.0s/1m25.0s

running (1m15.0s), 119/120 VUs, 70832 complete and 0 interrupted iterations
mixed_ramp   [  88% ] 119/120 VUs  1m15.0s/1m25.0s

running (1m16.0s), 109/120 VUs, 71832 complete and 0 interrupted iterations
mixed_ramp   [  89% ] 109/120 VUs  1m16.0s/1m25.0s

running (1m17.0s), 097/120 VUs, 72835 complete and 0 interrupted iterations
mixed_ramp   [  91% ] 097/120 VUs  1m17.0s/1m25.0s

running (1m18.0s), 085/120 VUs, 73783 complete and 0 interrupted iterations
mixed_ramp   [  92% ] 085/120 VUs  1m18.0s/1m25.0s

running (1m19.0s), 073/120 VUs, 74679 complete and 0 interrupted iterations
mixed_ramp   [  93% ] 073/120 VUs  1m19.0s/1m25.0s

running (1m20.0s), 061/120 VUs, 75614 complete and 0 interrupted iterations
mixed_ramp   [  94% ] 061/120 VUs  1m20.0s/1m25.0s

running (1m21.0s), 049/120 VUs, 76574 complete and 0 interrupted iterations
mixed_ramp   [  95% ] 049/120 VUs  1m21.0s/1m25.0s

running (1m22.0s), 037/120 VUs, 77514 complete and 0 interrupted iterations
mixed_ramp   [  96% ] 037/120 VUs  1m22.0s/1m25.0s

running (1m23.0s), 025/120 VUs, 78366 complete and 0 interrupted iterations
mixed_ramp   [  98% ] 025/120 VUs  1m23.0s/1m25.0s

running (1m24.0s), 013/120 VUs, 79327 complete and 0 interrupted iterations
mixed_ramp   [  99% ] 013/120 VUs  1m24.0s/1m25.0s

running (1m25.0s), 001/120 VUs, 80144 complete and 0 interrupted iterations
mixed_ramp   [ 100% ] 001/120 VUs  1m25.0s/1m25.0s


  █ TOTAL RESULTS 

    checks_total.......: 400745  4714.60729/s
    checks_succeeded...: 100.00% 400745 out of 400745
    checks_failed......: 0.00%   0 out of 400745

    ✓ 278 ok
    ✓ 835 ok
    ✓ hl7 ok
    ✓ fhir ok
    ✓ decide ok

    HTTP
    http_req_duration..............: avg=9.25ms  min=182µs  med=6.61ms  p(95)=22.88ms  p(99)=27.33ms  max=580.68ms
      { expected_response:true }...: avg=9.25ms  min=182µs  med=6.61ms  p(95)=22.88ms  p(99)=27.33ms  max=580.68ms
    http_req_failed................: 0.00%  0 out of 400745
    http_reqs......................: 400745 4714.60729/s

    EXECUTION
    iteration_duration.............: avg=46.42ms min=1.23ms med=33.07ms p(95)=115.74ms p(99)=139.23ms max=855.98ms
    iterations.....................: 80149  942.921458/s
    vus............................: 1      min=0           max=119
    vus_max........................: 120    min=120         max=120

    NETWORK
    data_received..................: 93 MB  1.1 MB/s
    data_sent......................: 182 MB 2.1 MB/s



running (1m25.0s), 000/120 VUs, 80149 complete and 0 interrupted iterations
mixed_ramp ✓ [ 100% ] 000/120 VUs  1m25s